# SQL

Accessing data stored in databases is a routine exercise. I demonstrate a few helpful methods in the Jupyter Notebook.

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [1]:
!conda install -c conda-forge ipython-sql -y

Fetching package metadata ...........
Solving package specifications: .

Package plan for installation in environment /Users/jonathan/miniconda3/envs/insightpy:

The following NEW packages will be INSTALLED:

    ipython-sql: 0.3.6-py36_1  conda-forge
    prettytable: 0.7.2-py36_1  conda-forge
    sqlalchemy:  1.1.13-py36_0 conda-forge
    sqlparse:    0.2.3-py36_0  conda-forge

prettytable-0. 100% |################################| Time: 0:00:00 308.64 kB/s
sqlalchemy-1.1 100% |################################| Time: 0:00:00   1.79 MB/s
sqlparse-0.2.3 100% |################################| Time: 0:00:00  10.61 MB/s
ipython-sql-0. 100% |################################| Time: 0:00:00  13.15 MB/s

In [2]:
%load_ext sql

/Users/jonathan/miniconda3/envs/insightpy/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/jonathan/miniconda3/envs/insightpy/lib/python3.6/site-packages/sql/magic.py:4: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  from IPython.utils.traitlets import Bool, Int, Unicode

In [3]:
%config SqlMagic.autopandas=True

In [4]:
import pandas as pd
import sqlite3

In [5]:
import warnings
warnings.filterwarnings('ignore')

```SQL
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);
```

In [6]:
%%sql sqlite://
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [7]:
later_presidents = %sql SELECT * FROM presidents WHERE year_of_birth > 1825
later_presidents

Done.

  first_name  last_name  year_of_birth
0   Theodore  Roosevelt           1858
1    Richard      Nixon           1913
2     Barack      Obama           1961

In [8]:
type(later_presidents)

pandas.core.frame.DataFrame

In [9]:
con = sqlite3.connect("presidents.sqlite")
later_presidents.to_sql("presidents", con, if_exists='replace')

## Through pandas directly

In [10]:
%%sql
SELECT first_name,
       last_name,
       year_of_birth
FROM presidents
WHERE year_of_birth > 1800;

Done.

  first_name  last_name  year_of_birth
0    Abraham    Lincoln           1809
1   Theodore  Roosevelt           1858
2    Richard      Nixon           1913
3     Barack      Obama           1961

```SQL
SELECT first_name,
       last_name,
       year_of_birth
FROM presidents
WHERE year_of_birth > 1800;
```

In [11]:
con = sqlite3.connect("presidents.sqlite")
cur = con.cursor()

new_dataframe = pd.read_sql("""SELECT first_name, last_name, year_of_birth
                               FROM presidents
                               WHERE year_of_birth > 1800
                               """, 
                            con=con)

con.close()

In [12]:
new_dataframe

  first_name  last_name  year_of_birth
0   Theodore  Roosevelt           1858
1    Richard      Nixon           1913
2     Barack      Obama           1961

In [13]:
type(new_dataframe)

pandas.core.frame.DataFrame